<?php

return [
    // ================== asset version ==================
    'asset_version' => '20250515',

    // ================== master ip (password 체크 무시) ==================
    'masterIp' => [
        '218.235.94.247',
        '218.235.94.243',
//        '218.235.94.216', //나리씨 교육강좌 검수용
    ],

    // ================== debug ip (debugbar 노출) ==================
    'debugIp' => [
        '218.235.94.247',
        '218.235.94.243',
    ],

    // ================== dev ip (error 페이지 노출) ==================
    'devIp' => [
        '218.235.94.247',
        '218.235.94.243',
        '218.235.94.216', //나리씨
        '175.114.234.241', //학회 결제
    ],

    // ================= api =================
    'api' => [
        'url' => env('APP_URL') . '/api',
    ],

    // ================= web =================
    'web' => [
        'app_name' => env('APP_NAME'),
        'url' => env('APP_URL'),
    ],
    // ================= eng =================
    'eng' => [
        'app_name' => 'ALLERGY',
        'url' => env('APP_URL') . '/eng',
    ],
    
    // ================= admin =================
    'admin' => [
        'app_name' => '관리자 | ' . env('APP_NAME'),
        'url' => env('APP_URL') . '/admin',
    ],

    'info' => [
        'address' => '',
        'email' => '',
        'tel' => '',
        'fax' => '',
    ],
];
