<?php

$year = [];

for ($i = 2010; $i <= 2040; $i++) {
    $year[$i] = $i;
}

return [
    'year' => $year,

    'level' => [
        'A' => '정회원',
        'B' => '준회원',
    ],

    'category' => [
        'A' => '입회비',
        'B' => '연회비',
        'C' => '평생회비',
    ],
    'payment_method' => [
        'C' => '신용카드',
        'B' => '무통장입금',
//        'DirectBank' => '실시간계좌이체',
//        'VBank' => '가상계좌',
    ],

    'payment_status' => [
        'Y' => '완납',
        'N' => '미납',
    ],

    'price' => [
        'A'/*정회원*/ => [ //회원 등급
            'A' => 100000,
            'B' => 50000,
            'C' => 500000,
            'D' => 300000, //50세 이상은 300000 => /admin/memberService 에서 사용, 이외에 사용X
        ],
        'B'/*준회원*/ => [
            'A' => 100000,
            'B' => 30000,
        ],
    ],

]
?>