<?php
$year = [];

for($i = 2050; $i >= 2000; $i--) {
    array_push($year, $i);
}

return [
    'year' => $year,
    
    'hide' => [
        'Y'=>'비공개', 'N'=>'공개',
    ],

    'complete' => [
        'Y'=>'등록완료', 'N'=>'등록중',
    ],

    'judge' => [
        'Y'=>'선정', 'N'=>'미선정', 'I'=>'심사중',
    ],

    'report' => [
        'Y'=>'제출완료', 'N'=>'미제출',
    ],

    'assistant' => [
        'A'=>'한국제약바이오협회(KPBMA)', 'B'=>'한국글로벌의약산업협회(KRPIA)',
    ],

    'assistant_name' => [
        'A'=>'(KPBMA)', 'B'=>'(KRPIA)',
    ],

    'pay_result' => [
        'Y'=>'지급완료', 'N'=>'미지급',
    ],

    'presenter' => [
        'A'=>'구연',
        'B'=>'포스터',
        'C'=>'e-포스터',
        'D'=>'공동저자',
    ],

    'lecture' => [
        'A'=>'연자',
        'B'=>'좌장',
    ],

    'attend' => [
        'A'=>'대면 참석',
    ],

    'submit_type' => [
        'A'=>'바로 제출',
        'B'=>'추후 제출',
    ],

    'agree2' => [
        'Y'=>'동의합니다.',
        'N'=>'동의하지 않습니다.',
    ],
];
